``` 
❯ terraform plan -target=module.aws_iam_fedramp
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

module.aws_iam_fedramp.data.aws_iam_policy_document.ec2_assume_role_policy: Refreshing state...
module.aws_iam_fedramp.data.aws_iam_policy_document.this["read_only_admin"]: Refreshing state...
module.aws_iam_fedramp.data.aws_iam_policy_document.this["iam_admin"]: Refreshing state...
module.aws_iam_fedramp.data.aws_iam_policy_document.this["instance_ops"]: Refreshing state...
module.aws_iam_fedramp.data.aws_iam_policy_document.this["sysadmin"]: Refreshing state...
module.aws_iam_fedramp.data.aws_iam_policy_document.this["read_only_billing"]: Refreshing state...

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.aws_iam_fedramp.aws_iam_group.this["iam_admin"] will be created
  + resource "aws_iam_group" "this" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "demo-dev-us-east-1-fedramp-iam_admin-iam-group"
      + path      = "/demo/dev/us-east-1/"
      + unique_id = (known after apply)
    }

  # module.aws_iam_fedramp.aws_iam_group.this["instance_ops"] will be created
  + resource "aws_iam_group" "this" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "demo-dev-us-east-1-fedramp-instance_ops-iam-group"
      + path      = "/demo/dev/us-east-1/"
      + unique_id = (known after apply)
    }

  # module.aws_iam_fedramp.aws_iam_group.this["read_only_admin"] will be created
  + resource "aws_iam_group" "this" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "demo-dev-us-east-1-fedramp-read_only_admin-iam-group"
      + path      = "/demo/dev/us-east-1/"
      + unique_id = (known after apply)
    }

  # module.aws_iam_fedramp.aws_iam_group.this["read_only_billing"] will be created
  + resource "aws_iam_group" "this" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "demo-dev-us-east-1-fedramp-read_only_billing-iam-group"
      + path      = "/demo/dev/us-east-1/"
      + unique_id = (known after apply)
    }

  # module.aws_iam_fedramp.aws_iam_group.this["sysadmin"] will be created
  + resource "aws_iam_group" "this" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "demo-dev-us-east-1-fedramp-sysadmin-iam-group"
      + path      = "/demo/dev/us-east-1/"
      + unique_id = (known after apply)
    }

  # module.aws_iam_fedramp.aws_iam_group_policy_attachment.this["iam_admin"] will be created
  + resource "aws_iam_group_policy_attachment" "this" {
      + group      = "demo-dev-us-east-1-fedramp-iam_admin-iam-group"
      + id         = (known after apply)
      + policy_arn = (known after apply)
    }

  # module.aws_iam_fedramp.aws_iam_group_policy_attachment.this["instance_ops"] will be created
  + resource "aws_iam_group_policy_attachment" "this" {
      + group      = "demo-dev-us-east-1-fedramp-instance_ops-iam-group"
      + id         = (known after apply)
      + policy_arn = (known after apply)
    }

  # module.aws_iam_fedramp.aws_iam_group_policy_attachment.this["read_only_admin"] will be created
  + resource "aws_iam_group_policy_attachment" "this" {
      + group      = "demo-dev-us-east-1-fedramp-read_only_admin-iam-group"
      + id         = (known after apply)
      + policy_arn = (known after apply)
    }

  # module.aws_iam_fedramp.aws_iam_group_policy_attachment.this["read_only_billing"] will be created
  + resource "aws_iam_group_policy_attachment" "this" {
      + group      = "demo-dev-us-east-1-fedramp-read_only_billing-iam-group"
      + id         = (known after apply)
      + policy_arn = (known after apply)
    }

  # module.aws_iam_fedramp.aws_iam_group_policy_attachment.this["sysadmin"] will be created
  + resource "aws_iam_group_policy_attachment" "this" {
      + group      = "demo-dev-us-east-1-fedramp-sysadmin-iam-group"
      + id         = (known after apply)
      + policy_arn = (known after apply)
    }

  # module.aws_iam_fedramp.aws_iam_instance_profile.this["iam_admin"] will be created
  + resource "aws_iam_instance_profile" "this" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "demo-dev-us-east-1-fedramp-iam_admin-iam-instance-profile"
      + path        = "/demo/dev/us-east-1/"
      + role        = "demo-dev-us-east-1-fedramp-iam_admin-iam-role"
      + roles       = (known after apply)
      + unique_id   = (known after apply)
    }

  # module.aws_iam_fedramp.aws_iam_instance_profile.this["instance_ops"] will be created
  + resource "aws_iam_instance_profile" "this" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "demo-dev-us-east-1-fedramp-instance_ops-iam-instance-profile"
      + path        = "/demo/dev/us-east-1/"
      + role        = "demo-dev-us-east-1-fedramp-instance_ops-iam-role"
      + roles       = (known after apply)
      + unique_id   = (known after apply)
    }

  # module.aws_iam_fedramp.aws_iam_instance_profile.this["read_only_admin"] will be created
  + resource "aws_iam_instance_profile" "this" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "demo-dev-us-east-1-fedramp-read_only_admin-iam-instance-profile"
      + path        = "/demo/dev/us-east-1/"
      + role        = "demo-dev-us-east-1-fedramp-read_only_admin-iam-role"
      + roles       = (known after apply)
      + unique_id   = (known after apply)
    }

  # module.aws_iam_fedramp.aws_iam_instance_profile.this["read_only_billing"] will be created
  + resource "aws_iam_instance_profile" "this" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "demo-dev-us-east-1-fedramp-read_only_billing-iam-instance-profile"
      + path        = "/demo/dev/us-east-1/"
      + role        = "demo-dev-us-east-1-fedramp-read_only_billing-iam-role"
      + roles       = (known after apply)
      + unique_id   = (known after apply)
    }

  # module.aws_iam_fedramp.aws_iam_instance_profile.this["sysadmin"] will be created
  + resource "aws_iam_instance_profile" "this" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "demo-dev-us-east-1-fedramp-sysadmin-iam-instance-profile"
      + path        = "/demo/dev/us-east-1/"
      + role        = "demo-dev-us-east-1-fedramp-sysadmin-iam-role"
      + roles       = (known after apply)
      + unique_id   = (known after apply)
    }

  # module.aws_iam_fedramp.aws_iam_policy.this["iam_admin"] will be created
  + resource "aws_iam_policy" "this" {
      + arn    = (known after apply)
      + id     = (known after apply)
      + name   = "demo-dev-us-east-1-fedramp-iam_admin-iam-policy"
      + path   = "/demo/dev/us-east-1/"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "iam:*"
                      + Condition = {
                          + Bool = {
                              + aws:MultiFactorAuthPresent = [
                                  + "true",
                                ]
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                      + Sid       = ""
                    },
                  + {
                      + Action   = "aws-portal:*Billing"
                      + Effect   = "Deny"
                      + Resource = "*"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # module.aws_iam_fedramp.aws_iam_policy.this["instance_ops"] will be created
  + resource "aws_iam_policy" "this" {
      + arn    = (known after apply)
      + id     = (known after apply)
      + name   = "demo-dev-us-east-1-fedramp-instance_ops-iam-policy"
      + path   = "/demo/dev/us-east-1/"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "ec2:*"
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                  + {
                      + Action   = "elasticloadbalancing:*"
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                  + {
                      + Action   = "cloudwatch:*"
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                  + {
                      + Action   = "autoscaling:*"
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                  + {
                      + Action   = [
                          + "ec2:CreateVpc*",
                          + "ec2:DeleteVpc*",
                          + "ec2:ModifyVpc*",
                          + "ec2:CreateSubnet*",
                          + "ec2:DeleteSubnet*",
                          + "ec2:ModifySubnet*",
                          + "ec2:Create*Route*",
                          + "ec2:DeleteRoute*",
                          + "ec2:AssociateRoute*",
                          + "ec2:ReplaceRoute*",
                          + "ec2:CreateVpn*",
                          + "ec2:DeleteVpn*",
                          + "ec2:AttachVpn*",
                          + "ec2:DetachVpn*",
                          + "ec2:CreateNetworkAcl*",
                          + "ec2:DeleteNetworkAcl*",
                          + "ec2:ReplaceNetworkAcl*",
                          + "ec2:*Gateway*",
                          + "ec2:*PeeringConnection*",
                        ]
                      + Effect   = "Deny"
                      + Resource = "*"
                      + Sid      = ""
                    },
                  + {
                      + Action   = "aws-portal:*Billing"
                      + Effect   = "Deny"
                      + Resource = "*"
                      + Sid      = ""
                    },
                  + {
                      + Action   = [
                          + "kms:Create*",
                          + "kms:Revoke*",
                          + "kms:Enable*",
                          + "kms:Get*",
                          + "kms:Disable*",
                          + "kms:Delete*",
                          + "kms:Put*",
                          + "kms:Update*",
                        ]
                      + Effect   = "Deny"
                      + Resource = "*"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # module.aws_iam_fedramp.aws_iam_policy.this["read_only_admin"] will be created
  + resource "aws_iam_policy" "this" {
      + arn    = (known after apply)
      + id     = (known after apply)
      + name   = "demo-dev-us-east-1-fedramp-read_only_admin-iam-policy"
      + path   = "/demo/dev/us-east-1/"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "appstream:Get*",
                          + "autoscaling:Describe*",
                          + "cloudformation:DescribeStacks",
                          + "cloudformation:DescribeStackEvents",
                          + "cloudformation:DescribeStackResource",
                          + "cloudformation:DescribeStackResources",
                          + "cloudformation:GetTemplate",
                          + "cloudformation:List*",
                          + "cloudfront:Get*",
                          + "cloudfront:List*",
                          + "cloudtrail:DescribeTrails",
                          + "cloudtrail:GetTrailStatus",
                          + "cloudwatch:Describe*",
                          + "cloudwatch:Get*",
                          + "cloudwatch:List*",
                          + "directconnect:Describe*",
                          + "dynamodb:GetItem",
                          + "dynamodb:BatchGetItem",
                          + "dynamodb:Query",
                          + "dynamodb:Scan",
                          + "dynamodb:DescribeTable",
                          + "dynamodb:ListTables",
                          + "ec2:Describe*",
                          + "elasticache:Describe*",
                          + "elasticbeanstalk:Check*",
                          + "elasticbeanstalk:Describe*",
                          + "elasticbeanstalk:List*",
                          + "elasticbeanstalk:RequestEnvironmentInfo",
                          + "elasticbeanstalk:RetrieveEnvironmentInfo",
                          + "elasticloadbalancing:Describe*",
                          + "elastictranscoder:Read*",
                          + "elastictranscoder:List*",
                          + "iam:List*",
                          + "iam:Get*",
                          + "kinesis:Describe*",
                          + "kinesis:Get*",
                          + "kinesis:List*",
                          + "opsworks:Describe*",
                          + "opsworks:Get*",
                          + "route53:Get*",
                          + "route53:List*",
                          + "redshift:Describe*",
                          + "redshift:ViewQueriesInConsole",
                          + "rds:Describe*",
                          + "rds:ListTagsForResource",
                          + "s3:Get*",
                          + "s3:List*",
                          + "sdb:GetAttributes",
                          + "sdb:List*",
                          + "sdb:Select*",
                          + "ses:Get*",
                          + "ses:List*",
                          + "sns:Get*",
                          + "sns:List*",
                          + "sqs:GetQueueAttributes",
                          + "sqs:ListQueues",
                          + "sqs:ReceiveMessage",
                          + "storagegateway:List*",
                          + "storagegateway:Describe*",
                          + "trustedadvisor:Describe*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                  + {
                      + Action   = "aws-portal:*Billing"
                      + Effect   = "Deny"
                      + Resource = "*"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # module.aws_iam_fedramp.aws_iam_policy.this["read_only_billing"] will be created
  + resource "aws_iam_policy" "this" {
      + arn    = (known after apply)
      + id     = (known after apply)
      + name   = "demo-dev-us-east-1-fedramp-read_only_billing-iam-policy"
      + path   = "/demo/dev/us-east-1/"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "aws-portal:View*"
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                  + {
                      + Action   = "aws-portal:*Account"
                      + Effect   = "Deny"
                      + Resource = "*"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # module.aws_iam_fedramp.aws_iam_policy.this["sysadmin"] will be created
  + resource "aws_iam_policy" "this" {
      + arn    = (known after apply)
      + id     = (known after apply)
      + name   = "demo-dev-us-east-1-fedramp-sysadmin-iam-policy"
      + path   = "/demo/dev/us-east-1/"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Condition = {
                          + Bool = {
                              + aws:MultiFactorAuthPresent = [
                                  + "true",
                                ]
                            }
                        }
                      + Effect    = "Allow"
                      + NotAction = "iam:*"
                      + Resource  = "*"
                      + Sid       = ""
                    },
                  + {
                      + Action   = "aws-portal:*Billing"
                      + Effect   = "Deny"
                      + Resource = "*"
                      + Sid      = ""
                    },
                  + {
                      + Action   = [
                          + "cloudtrail:DeleteTrail",
                          + "cloudtrail:StopLogging",
                          + "cloudtrail:UpdateTrail",
                        ]
                      + Effect   = "Deny"
                      + Resource = "*"
                      + Sid      = ""
                    },
                  + {
                      + Action   = [
                          + "kms:Create*",
                          + "kms:Revoke*",
                          + "kms:Enable*",
                          + "kms:Get*",
                          + "kms:Disable*",
                          + "kms:Delete*",
                          + "kms:Put*",
                          + "kms:Update*",
                        ]
                      + Effect   = "Deny"
                      + Resource = "*"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # module.aws_iam_fedramp.aws_iam_role.this["iam_admin"] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "demo-dev-us-east-1-fedramp-iam_admin-iam-role"
      + path                  = "/"
      + tags                  = {
          + "Application" = "demo"
          + "Environment" = "dev"
          + "Name"        = "demo-dev-us-east-1-fedramp-iam_admin-iam-role"
          + "Region"      = "us-east-1"
        }
      + unique_id             = (known after apply)
    }

  # module.aws_iam_fedramp.aws_iam_role.this["instance_ops"] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "demo-dev-us-east-1-fedramp-instance_ops-iam-role"
      + path                  = "/"
      + tags                  = {
          + "Application" = "demo"
          + "Environment" = "dev"
          + "Name"        = "demo-dev-us-east-1-fedramp-instance_ops-iam-role"
          + "Region"      = "us-east-1"
        }
      + unique_id             = (known after apply)
    }

  # module.aws_iam_fedramp.aws_iam_role.this["read_only_admin"] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "demo-dev-us-east-1-fedramp-read_only_admin-iam-role"
      + path                  = "/"
      + tags                  = {
          + "Application" = "demo"
          + "Environment" = "dev"
          + "Name"        = "demo-dev-us-east-1-fedramp-read_only_admin-iam-role"
          + "Region"      = "us-east-1"
        }
      + unique_id             = (known after apply)
    }

  # module.aws_iam_fedramp.aws_iam_role.this["read_only_billing"] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "demo-dev-us-east-1-fedramp-read_only_billing-iam-role"
      + path                  = "/"
      + tags                  = {
          + "Application" = "demo"
          + "Environment" = "dev"
          + "Name"        = "demo-dev-us-east-1-fedramp-read_only_billing-iam-role"
          + "Region"      = "us-east-1"
        }
      + unique_id             = (known after apply)
    }

  # module.aws_iam_fedramp.aws_iam_role.this["sysadmin"] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "demo-dev-us-east-1-fedramp-sysadmin-iam-role"
      + path                  = "/"
      + tags                  = {
          + "Application" = "demo"
          + "Environment" = "dev"
          + "Name"        = "demo-dev-us-east-1-fedramp-sysadmin-iam-role"
          + "Region"      = "us-east-1"
        }
      + unique_id             = (known after apply)
    }

  # module.aws_iam_fedramp.aws_iam_role_policy_attachment.this["iam_admin"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "demo-dev-us-east-1-fedramp-iam_admin-iam-role"
    }

  # module.aws_iam_fedramp.aws_iam_role_policy_attachment.this["instance_ops"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "demo-dev-us-east-1-fedramp-instance_ops-iam-role"
    }

  # module.aws_iam_fedramp.aws_iam_role_policy_attachment.this["read_only_admin"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "demo-dev-us-east-1-fedramp-read_only_admin-iam-role"
    }

  # module.aws_iam_fedramp.aws_iam_role_policy_attachment.this["read_only_billing"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "demo-dev-us-east-1-fedramp-read_only_billing-iam-role"
    }

  # module.aws_iam_fedramp.aws_iam_role_policy_attachment.this["sysadmin"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "demo-dev-us-east-1-fedramp-sysadmin-iam-role"
    }

Plan: 30 to add, 0 to change, 0 to destroy.```